# Brewfile — essentials for TypeScript dev
# Install with: brew bundle --file=~/.dotfiles/Brewfile

tap "oven-sh/bun"

# Core toolchain
brew "git"
brew "gh"
brew "nvm"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "biome"
brew "prettier"

# Editor + terminal
brew "neovim"
brew "tmux"
brew "tpm"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "tree-sitter"
brew "lua-language-server"
brew "stylua"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "starship"
brew "zoxide"
brew "git-delta"
brew "lazygit"
brew "jq"

# CLI niceties (day-1 muscle memory)
brew "bat"
brew "eza"
brew "btop"
brew "htop"
brew "dust"
brew "tree"
brew "yazi"
brew "wget"
brew "yq"
brew "zsh"

# Postgres
brew "libpq"
brew "pgcli"

# Casks
brew "container"

cask "ghostty"
cask "claude-code"
cask "docker-desktop"
cask "zed"
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask "brave-browser"
cask "google-chrome"
cask "postico"
cask "slack"
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-zed-mono-nerd-font"
cask "font-ubuntu-mono"

# VS Code extensions — TS day-1
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rotorsoft.act-vscode"
vscode "rotorsoft.dark-rotor"
vscode "rotorsoft.esml2eventually"
vscode "supermaven.supermaven"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
