tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "modularml/packages"
tap "ngrok/ngrok"
tap "oven-sh/bun"
brew "ack"
brew "libgit2@1.7"
brew "bat"
brew "btop"
brew "python@3.13"
brew "glib"
brew "python@3.12"
brew "cmake"
brew "dust"
brew "fd"
brew "fzf"
brew "geos"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "graphviz"
brew "htop"
brew "jq"
brew "k9s"
brew "libpq"
brew "llvm@17"
brew "lsd"
brew "micro"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "pnpm"
brew "poetry"
brew "poppler-qt5"
brew "powerlevel10k"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "telnet"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
cask "brave-browser"
cask "discord"
cask "docker"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "miro"
cask "ngrok"
cask "obsidian"
cask "postico"
cask "postman"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arcanis.vscode-zipfs"
vscode "be5invis.vscode-custom-css"
vscode "benspaulding.procfile"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dunn.redis"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "modular-mojotools.vscode-mojo"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nextnav.nextnav"
vscode "njpwerner.autodocstring"
vscode "nomicfoundation.hardhat-solidity"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rotorsoft.dark-rotor"
vscode "rotorsoft.esml2eventually"
vscode "rust-lang.rust-analyzer"
vscode "supermaven.supermaven"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
