tap "modularml/packages"
tap "oven-sh/bun"
tap "sst/tap"
brew "ack"
brew "libgit2"
brew "bat"
brew "btop"
brew "glib"
brew "clang-format"
brew "cling"
brew "cmake"
brew "dust"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "geos"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "go"
brew "heroku"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "lazygit"
brew "libpq"
brew "llvm@17"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "micro"
brew "neonctl"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "python@3.13"
brew "nmap"
brew "nvm"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "poppler-qt5"
brew "powerlevel10k"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "starship"
brew "stylua"
brew "tectonic"
brew "telnet"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "modularml/packages/modular"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
cask "brave-browser"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "miro"
cask "ngrok"
cask "obsidian"
cask "postico"
cask "postman"
cask "redis-insight"
cask "slack"
cask "telegram"
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "arcanis.vscode-zipfs"
vscode "benspaulding.procfile"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dunn.redis"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nextnav.nextnav"
vscode "nomicfoundation.hardhat-solidity"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rotorsoft.dark-rotor"
vscode "rotorsoft.esml2eventually"
vscode "supermaven.supermaven"
vscode "tomoki1207.pdf"
vscode "vitest.explorer"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
